Treating missing values

working with missing values in pandas

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame(np.arange(1,101,5).reshape(5,4), index = ["row 1", "row 2", "row 3", "row 4", "row 5"],
                  columns= ["col 1", "col 2", "col 3","col 4"])
print(df)

       col 1  col 2  col 3  col 4
row 1      1      6     11     16
row 2     21     26     31     36
row 3     41     46     51     56
row 4     61     66     71     76
row 5     81     86     91     96

In [7]:
data = {
    'names': ['steve', 'john', 'richard', 'sarah', 'randy', 'micheal', 'julie'],
    'age': [20, 22, 20, 21, 24, 23, 22],
    'gender': ['Male', 'Male', 'Male', 'Female', 'Male', 'Male', 'Female'],
    'rank': [2, 1, 4, 5, 3, 7, 6]
}
data_data_frame = pd.DataFrame(data)
print(data_data_frame)

     names  age  gender  rank
0    steve   20    Male     2
1     john   22    Male     1
2  richard   20    Male     4
3    sarah   21  Female     5
4    randy   24    Male     3
5  micheal   23    Male     7
6    julie   22  Female     6

Finding vissing values

In [11]:
# Filling some values with null
data_data_frame.iloc[2:5,1] = np.nan
print(data_data_frame)
data_data_frame.iloc[3:6,3] = np.nan
print("\n",data_data_frame)
data_data_frame.iloc[3, :] = np.nan
print("\n",data_data_frame)

     names   age  gender  rank
0    steve  20.0    Male   2.0
1     john  22.0    Male   1.0
2  richard   NaN    Male   4.0
3      NaN   NaN     NaN   NaN
4    randy   NaN    Male   NaN
5  micheal  23.0    Male   NaN
6    julie  22.0  Female   6.0

      names   age  gender  rank
0    steve  20.0    Male   2.0
1     john  22.0    Male   1.0
2  richard   NaN    Male   4.0
3      NaN   NaN     NaN   NaN
4    randy   NaN    Male   NaN
5  micheal  23.0    Male   NaN
6    julie  22.0  Female   6.0

      names   age  gender  rank
0    steve  20.0    Male   2.0
1     john  22.0    Male   1.0
2  richard   NaN    Male   4.0
3      NaN   NaN     NaN   NaN
4    randy   NaN    Male   NaN
5  micheal  23.0    Male   NaN
6    julie  22.0  Female   6.0

In [12]:
# Gives you True wherever there is null
data_data_frame.isnull()

   names    age  gender   rank
0  False  False   False  False
1  False  False   False  False
2  False   True   False  False
3   True   True    True   True
4  False   True   False   True
5  False  False   False   True
6  False  False   False  False

In [14]:
# Gives you all the rows which are null in age column
bool_series = pd.isnull(data_data_frame['age'])
print(bool_series)

0    False
1    False
2     True
3     True
4     True
5    False
6    False
Name: age, dtype: bool

In [15]:
# fills all the null values with 0 
data_data_frame.fillna(0)

     names   age  gender  rank
0    steve  20.0    Male   2.0
1     john  22.0    Male   1.0
2  richard   0.0    Male   4.0
3        0   0.0       0   0.0
4    randy   0.0    Male   0.0
5  micheal  23.0    Male   0.0
6    julie  22.0  Female   6.0

In [16]:
# Fills all the null values with the previous row values using Pad
data_data_frame.fillna(method='pad')

C:\Users\SHAHZOR AHMED\AppData\Local\Temp\ipykernel_9564\3978744811.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data_data_frame.fillna(method='pad')

     names   age  gender  rank
0    steve  20.0    Male   2.0
1     john  22.0    Male   1.0
2  richard  22.0    Male   4.0
3  richard  22.0    Male   4.0
4    randy  22.0    Male   4.0
5  micheal  23.0    Male   4.0
6    julie  22.0  Female   6.0

In [21]:
# Fills all the null values with the next row values using bfill
data_data_frame.fillna(method='bfill')

C:\Users\SHAHZOR AHMED\AppData\Local\Temp\ipykernel_9564\1596715008.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data_data_frame.fillna(method='bfill')

     names   age  gender  rank
0    steve  20.0    Male   2.0
1     john  22.0    Male   1.0
2  richard  23.0    Male   4.0
3    randy  23.0    Male   6.0
4    randy  23.0    Male   6.0
5  micheal  23.0    Male   6.0
6    julie  22.0  Female   6.0

In [24]:
data_data_frame
print(data_data_frame)
data_data_frame.interpolate(method = 'linear')

     names   age  gender  rank
0    steve  20.0    Male   2.0
1     john  22.0    Male   1.0
2  richard   NaN    Male   4.0
3      NaN   NaN     NaN   NaN
4    randy   NaN    Male   NaN
5  micheal  23.0    Male   NaN
6    julie  22.0  Female   6.0

C:\Users\SHAHZOR AHMED\AppData\Local\Temp\ipykernel_9564\2816452391.py:3: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  data_data_frame.interpolate(method = 'linear')

     names    age  gender  rank
0    steve  20.00    Male   2.0
1     john  22.00    Male   1.0
2  richard  22.25    Male   4.0
3      NaN  22.50     NaN   4.5
4    randy  22.75    Male   5.0
5  micheal  23.00    Male   5.5
6    julie  22.00  Female   6.0

interpolate() is a method used to fill in missing values (NaN) in a dataset by estimating those values based on surrounding data.It essentially performs interpolation, which is the process of estimating unknown data points within a range of known data points.

In [27]:
# droping all the rows which are having null values
data_data_frame.dropna(how='all')

     names   age  gender  rank
0    steve  20.0    Male   2.0
1     john  22.0    Male   1.0
2  richard   NaN    Male   4.0
4    randy   NaN    Male   NaN
5  micheal  23.0    Male   NaN
6    julie  22.0  Female   6.0

In [28]:
data_data_frame.dropna()

   names   age  gender  rank
0  steve  20.0    Male   2.0
1   john  22.0    Male   1.0
6  julie  22.0  Female   6.0

In [29]:
data = {
    'name': ['John', 'Alice', 'Bob', 'Clara'],
    'age': [25, np.nan, 30, np.nan],
    'gender': ['M', 'F', 'M', 'F'],
    'rank': [1, 2, 3, 4]
}
user_df = pd.DataFrame(data)
user_df

    name   age gender  rank
0   John  25.0      M     1
1  Alice   NaN      F     2
2    Bob  30.0      M     3
3  Clara   NaN      F     4

In [31]:
# Calculating mean value of age column
mean_value_age = user_df['age'].mean()
mean_value_age

27.5

In [32]:
# Fill NaN values in 'age' column with the mean
user_df['age'].fillna(mean_value_age, inplace= True)

print(user_df)

    name   age gender  rank
0   John  25.0      M     1
1  Alice  27.5      F     2
2    Bob  30.0      M     3
3  Clara  27.5      F     4

C:\Users\SHAHZOR AHMED\AppData\Local\Temp\ipykernel_9564\404905645.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  user_df['age'].fillna(mean_value_age, inplace= True)

Handling missing values

In [33]:
data = {
    'Name': ['Alice', 'Bob', 'Alice', 'David'],
    'Age': [25, 30, 25, 40],
    'City': ['NY', 'LA', 'NY', 'SF']
}
data_df = pd.DataFrame(data)
print(data_df)

    Name  Age City
0  Alice   25   NY
1    Bob   30   LA
2  Alice   25   NY
3  David   40   SF

In [36]:
# Checking for duplicate rows
data_df.duplicated()

0    False
1    False
2     True
3    False
dtype: bool

In [38]:
# You can remove the duplicate rows
df_cleaned = data_df.drop_duplicates()
df_cleaned

    Name  Age City
0  Alice   25   NY
1    Bob   30   LA
3  David   40   SF

In [39]:
data_df.drop_duplicates(inplace = True)
data_df

    Name  Age City
0  Alice   25   NY
1    Bob   30   LA
3  David   40   SF

In [40]:
DF_obj = pd.DataFrame({
    'column 1': [1, 1, 2, 2, 3, 3, 3],
    'column 2': ['a', 'a', 'b', 'b', 'c', 'c', 'c'],
    'column 3': ['A', 'A', 'B', 'B', 'C', 'C', 'C']
})

DF_obj

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

In [41]:
DF_obj.drop_duplicates()

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C

In [42]:
# Removes the rows with duplicate values in column 3
DF_obj.drop_duplicates(['column 3'], inplace = True)
print(DF_obj)

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C